# HeatingCoilType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ZoneEquipmentData..::..HeatingCoilType Property
ZoneEquipmentData Class See Also
---
The type of heating coil. Note this property change would reset the hot water loop.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public AirHeatingCoilType HeatingCoilType { get; set; }
```

Visual Basic
---
```text
Public Property HeatingCoilType As AirHeatingCoilType
	Get
	Set
```

Visual C++
---
```text
public:
property AirHeatingCoilType HeatingCoilType {
	AirHeatingCoilType get ();
	void set (AirHeatingCoilType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace